rails-with-webpacker-react-master/app/controllers/api/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    page = 1
    page = params[:page] if params[:page]
    per_page = 10
    per_page = params[:per_page] if params[:per_page]
    @articles = Article.paginate(page: page, per_page: per_page).order(created_at: :desc)

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hola"], ["content", "Mundo"], ["created_at", "2020-01-09 15:45:46.339289"], ["updated_at", "2020-01-09 15:45:46.339289"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save